[NoCoverage] BlockStatement
src/auth/auth.controller.ts:11:46
   constructor(private readonly authService: AuthService) {}
 
   @Post('register')
-  register(@Body() registerDto: RegisterDto) {
-    return this.authService.register(registerDto);
-  }
+  register(@Body() registerDto: RegisterDto) {}
 
   @Post('login')

[NoCoverage] BlockStatement
src/auth/auth.controller.ts:16:37
   }
 
   @Post('login')
-  login(@Body() loginDto: LoginDto) {
-    return this.authService.login(loginDto);
-  }
+  login(@Body() loginDto: LoginDto) {}
 }
 
