[NoCoverage] BlockStatement
src/auth/auth.service.ts:17:44
   constructor(@InjectModel(User.name) private userModel: Model<User>) {}
 
   // --- Реєстрація ---
-  async register(registerDto: RegisterDto) {
-    const existingUser = await this.userModel.findOne({
-      email: registerDto.email,
-    });
-
-    if (existingUser) {
-      throw new ConflictException('User with this email already exists');
-    }
-
-    const createdUser = new this.userModel(registerDto);
-    const savedUser = await createdUser.save();
-
-    return {
-      message: 'User registered successfully',
-      user: {
-        id: savedUser._id,
-        name: savedUser.name,
-        email: savedUser.email,
-      },
-    };
-  }
+  async register(registerDto: RegisterDto) {}
 
   // --- Логін ---

[NoCoverage] BlockStatement
src/auth/auth.service.ts:22:23
       email: registerDto.email,
     });
 
-    if (existingUser) {
-      throw new ConflictException('User with this email already exists');
-    }
+    if (existingUser) {}
 
     const createdUser = new this.userModel(registerDto);

[NoCoverage] StringLiteral
src/auth/auth.service.ts:30:16
     const savedUser = await createdUser.save();
 
     return {
-      message: 'User registered successfully',
+      message: "",
       user: {
         id: savedUser._id,

[NoCoverage] BlockStatement
src/auth/auth.service.ts:40:35
   }
 
   // --- Логін ---
-  async login(loginDto: LoginDto) {
-    const user = await this.userModel.findOne({ email: loginDto.email });
-
-    if (!user || user.password !== loginDto.password) {
-      throw new UnauthorizedException('Invalid email or password');
-    }
-
-    return {
-      message: 'Login successful',
-      user: {
-        id: user._id,
-        name: user.name,
-        email: user.email,
-      },
-    };
-  }
+  async login(loginDto: LoginDto) {}
 }
 

[NoCoverage] ObjectLiteral
src/auth/auth.service.ts:41:47
 
   // --- Логін ---
   async login(loginDto: LoginDto) {
-    const user = await this.userModel.findOne({ email: loginDto.email });
+    const user = await this.userModel.findOne({});
 
     if (!user || user.password !== loginDto.password) {

[NoCoverage] ConditionalExpression
src/auth/auth.service.ts:43:9
   async login(loginDto: LoginDto) {
     const user = await this.userModel.findOne({ email: loginDto.email });
 
-    if (!user || user.password !== loginDto.password) {
+    if (true) {
       throw new UnauthorizedException('Invalid email or password');
     }

[NoCoverage] ConditionalExpression
src/auth/auth.service.ts:43:9
   async login(loginDto: LoginDto) {
     const user = await this.userModel.findOne({ email: loginDto.email });
 
-    if (!user || user.password !== loginDto.password) {
+    if (false) {
       throw new UnauthorizedException('Invalid email or password');
     }

[NoCoverage] StringLiteral
src/auth/auth.service.ts:48:16
     }
 
     return {
-      message: 'Login successful',
+      message: "",
       user: {
         id: user._id,
