[NoCoverage] BlockStatement
src/cart/cart.controller.ts:18:19
   constructor(private readonly cartService: CartService) {}
 
   @Get()
-  async getCart() {
-    return this.cartService.getCart();
-  }
+  async getCart() {}
 
   @Post()

[NoCoverage] BlockStatement
src/cart/cart.controller.ts:23:46
   }
 
   @Post()
-  async addToCart(@Body() dto: AddToCartDto) {
-    return this.cartService.addToCart(dto);
-  }
+  async addToCart(@Body() dto: AddToCartDto) {}
 
   @Patch(':id')

[NoCoverage] BlockStatement
src/cart/cart.controller.ts:31:5
   async updateQuantity(
     @Param('id') id: string,
     @Body('quantity') quantity: number,
-  ) {
-    return this.cartService.updateQuantity(+id, quantity);
-  }
+  ) {}
 
   @Delete(':id')

[NoCoverage] UnaryOperator
src/cart/cart.controller.ts:32:44
     @Param('id') id: string,
     @Body('quantity') quantity: number,
   ) {
-    return this.cartService.updateQuantity(+id, quantity);
+    return this.cartService.updateQuantity(-id, quantity);
   }
 

[NoCoverage] BlockStatement
src/cart/cart.controller.ts:36:49
   }
 
   @Delete(':id')
-  async removeFromCart(@Param('id') id: string) {
-    return this.cartService.removeFromCart(+id);
-  }
+  async removeFromCart(@Param('id') id: string) {}
 }
 

[NoCoverage] UnaryOperator
src/cart/cart.controller.ts:37:44
 
   @Delete(':id')
   async removeFromCart(@Param('id') id: string) {
-    return this.cartService.removeFromCart(+id);
+    return this.cartService.removeFromCart(-id);
   }
 }
