[NoCoverage] BlockStatement
src/cart/cart.service.ts:23:73
 
     const fullCartItems = await Promise.all(
       cartItems.map(
-        async (item: CartDocument): Promise<CartItemResponse | null> => {
-          const productDetails = await this.productsService.findOne(
-            item.productID,
-          );
-
-          if (!productDetails) {
-            return null;
-          }
-
-          return {
-            ...(productDetails as ProductDocument).toObject(),
-            quantity: item.quantity,
-          };
-        },
+        async (item: CartDocument): Promise<CartItemResponse | null> => {},
       ),
     );

[NoCoverage] ConditionalExpression
src/cart/cart.service.ts:28:15
             item.productID,
           );
 
-          if (!productDetails) {
+          if (false) {
             return null;
           }

[NoCoverage] ConditionalExpression
src/cart/cart.service.ts:28:15
             item.productID,
           );
 
-          if (!productDetails) {
+          if (true) {
             return null;
           }

[NoCoverage] MethodExpression
src/cart/cart.service.ts:40:12
       ),
     );
 
-    return fullCartItems.filter(
-      (item): item is CartItemResponse => item !== null,
-    );
+    return fullCartItems;
   }
 

[NoCoverage] ArrowFunction
src/cart/cart.service.ts:41:7
     );
 
     return fullCartItems.filter(
-      (item): item is CartItemResponse => item !== null,
+      () => undefined,
     );
   }

[NoCoverage] ConditionalExpression
src/cart/cart.service.ts:41:43
     );
 
     return fullCartItems.filter(
-      (item): item is CartItemResponse => item !== null,
+      (item): item is CartItemResponse => true,
     );
   }

[NoCoverage] BlockStatement
src/cart/cart.service.ts:45:38
     );
   }
 
-  async addToCart(dto: AddToCartDto) {
-    const product = await this.productsService.findOne(dto.productID);
-    if (!product) {
-      throw new NotFoundException('Product not found');
-    }
-
-    const existingItem = await this.cartModel.findOne({
-      productID: dto.productID,
-    });
-
-    if (existingItem) {
-      existingItem.quantity += dto.quantity;
-      return existingItem.save();
-    } else {
-      const newItem = new this.cartModel(dto);
-      return newItem.save();
-    }
-  }
+  async addToCart(dto: AddToCartDto) {}
 
   async updateQuantity(productID: number, quantity: number) {

[NoCoverage] BooleanLiteral
src/cart/cart.service.ts:47:9
 
   async addToCart(dto: AddToCartDto) {
     const product = await this.productsService.findOne(dto.productID);
-    if (!product) {
+    if (product) {
       throw new NotFoundException('Product not found');
     }

[NoCoverage] ConditionalExpression
src/cart/cart.service.ts:47:9
 
   async addToCart(dto: AddToCartDto) {
     const product = await this.productsService.findOne(dto.productID);
-    if (!product) {
+    if (true) {
       throw new NotFoundException('Product not found');
     }

[NoCoverage] ObjectLiteral
src/cart/cart.service.ts:51:55
       throw new NotFoundException('Product not found');
     }
 
-    const existingItem = await this.cartModel.findOne({
-      productID: dto.productID,
-    });
+    const existingItem = await this.cartModel.findOne({});
 
     if (existingItem) {

[NoCoverage] BlockStatement
src/cart/cart.service.ts:55:23
       productID: dto.productID,
     });
 
-    if (existingItem) {
-      existingItem.quantity += dto.quantity;
-      return existingItem.save();
-    } else {
+    if (existingItem) {} else {
       const newItem = new this.cartModel(dto);
       return newItem.save();

[NoCoverage] AssignmentOperator
src/cart/cart.service.ts:56:7
     });
 
     if (existingItem) {
-      existingItem.quantity += dto.quantity;
+      existingItem.quantity -= dto.quantity;
       return existingItem.save();
     } else {

[NoCoverage] BlockStatement
src/cart/cart.service.ts:58:12
     if (existingItem) {
       existingItem.quantity += dto.quantity;
       return existingItem.save();
-    } else {
-      const newItem = new this.cartModel(dto);
-      return newItem.save();
-    }
+    } else {}
   }
 

[NoCoverage] BlockStatement
src/cart/cart.service.ts:64:61
     }
   }
 
-  async updateQuantity(productID: number, quantity: number) {
-    const updatedItem = await this.cartModel.findOneAndUpdate(
-      { productID },
-      { quantity },
-      { new: true },
-    );
-    return updatedItem;
-  }
+  async updateQuantity(productID: number, quantity: number) {}
 
   async removeFromCart(productID: number) {

[NoCoverage] BooleanLiteral
src/cart/cart.service.ts:68:14
     const updatedItem = await this.cartModel.findOneAndUpdate(
       { productID },
       { quantity },
-      { new: true },
+      { new: false },
     );
     return updatedItem;

[NoCoverage] BlockStatement
src/cart/cart.service.ts:73:43
     return updatedItem;
   }
 
-  async removeFromCart(productID: number) {
-    await this.cartModel.deleteOne({ productID });
-    return { message: 'Item removed' };
-  }
+  async removeFromCart(productID: number) {}
 
   async clearCart() {

[NoCoverage] StringLiteral
src/cart/cart.service.ts:75:23
 
   async removeFromCart(productID: number) {
     await this.cartModel.deleteOne({ productID });
-    return { message: 'Item removed' };
+    return { message: "" };
   }
 

[NoCoverage] ObjectLiteral
src/cart/cart.service.ts:75:12
 
   async removeFromCart(productID: number) {
     await this.cartModel.deleteOne({ productID });
-    return { message: 'Item removed' };
+    return {};
   }
 

[NoCoverage] BlockStatement
src/cart/cart.service.ts:78:21
     return { message: 'Item removed' };
   }
 
-  async clearCart() {
-    await this.cartModel.deleteMany({});
-    return { message: 'Cart cleared' };
-  }
+  async clearCart() {}
 }
 

[NoCoverage] StringLiteral
src/cart/cart.service.ts:80:23
 
   async clearCart() {
     await this.cartModel.deleteMany({});
-    return { message: 'Cart cleared' };
+    return { message: "" };
   }
 }
