[NoCoverage] BlockStatement
src/main.ts:4:28
 import { NestFactory } from '@nestjs/core';
 import { AppModule } from './app.module';
 
-async function bootstrap() {
-  const app = await NestFactory.create(AppModule);
-
-  // Активація CORS
-  app.enableCors({
-    origin: true,
-    methods: 'GET,HEAD,PUT,PATCH,POST,DELETE',
-    credentials: true,
-  });
-
-  await app.listen(process.env.PORT ?? 3000);
-}
+async function bootstrap() {}
 bootstrap();
 

[NoCoverage] ObjectLiteral
src/main.ts:8:18
   const app = await NestFactory.create(AppModule);
 
   // Активація CORS
-  app.enableCors({
-    origin: true,
-    methods: 'GET,HEAD,PUT,PATCH,POST,DELETE',
-    credentials: true,
-  });
+  app.enableCors({});
 
   await app.listen(process.env.PORT ?? 3000);

[NoCoverage] BooleanLiteral
src/main.ts:9:13
 
   // Активація CORS
   app.enableCors({
-    origin: true,
+    origin: false,
     methods: 'GET,HEAD,PUT,PATCH,POST,DELETE',
     credentials: true,

[NoCoverage] BooleanLiteral
src/main.ts:11:18
   app.enableCors({
     origin: true,
     methods: 'GET,HEAD,PUT,PATCH,POST,DELETE',
-    credentials: true,
+    credentials: false,
   });
 

[NoCoverage] LogicalOperator
src/main.ts:14:20
     credentials: true,
   });
 
-  await app.listen(process.env.PORT ?? 3000);
+  await app.listen(process.env.PORT && 3000);
 }
 bootstrap();
