[NoCoverage] BlockStatement
src/products/products.controller.ts:9:19
   constructor(private readonly productsService: ProductsService) {}
 
   @Get()
-  async findAll() {
-    return this.productsService.findAll();
-  }
+  async findAll() {}
 
   @Get(':id')

[NoCoverage] BlockStatement
src/products/products.controller.ts:14:42
   }
 
   @Get(':id')
-  async findOne(@Param('id') id: string) {
-    const product = await this.productsService.findOne(parseInt(id, 10));
-
-    if (!product) {
-      throw new NotFoundException(`Product with ID ${id} not found`);
-    }
-
-    return product;
-  }
+  async findOne(@Param('id') id: string) {}
 }
 
