[Survived] StringLiteral
src/products/products.service.ts:13:14
     produtDescription: 'A classic novel of the Jazz Age.',
     frontImg:
       'https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1490528560i/4671.jpg',
-    backImg: 'https://m.media-amazon.com/images/I/71J15XgZJXL.jpg',
+    backImg: "",
     productPrice: 15.99,
     productReviews: '4.5 stars (120 reviews)',

[Survived] StringLiteral
src/products/products.service.ts:19:18
   },
   {
     productID: 2,
-    productName: 'To Kill a Mockingbird',
+    productName: "",
     produtDescription: 'A story about racial injustice in the American South.',
     frontImg:

[NoCoverage] BlockStatement
src/products/products.service.ts:36:24
     @InjectModel(Product.name) private productModel: Model<Product>,
   ) {}
 
-  async onModuleInit() {
-    const count = await this.productModel.countDocuments();
-    if (count === 0) {
-      console.log('База товарів порожня. Завантажую початкові дані...');
-      await this.productModel.insertMany(INITIAL_STORE_DATA);
-      console.log('Товари успішно додані в MongoDB!');
-    }
-  }
+  async onModuleInit() {}
 
   async findAll(): Promise<Product[]> {

[NoCoverage] ConditionalExpression
src/products/products.service.ts:38:9
 
   async onModuleInit() {
     const count = await this.productModel.countDocuments();
-    if (count === 0) {
+    if (true) {
       console.log('База товарів порожня. Завантажую початкові дані...');
       await this.productModel.insertMany(INITIAL_STORE_DATA);

[NoCoverage] EqualityOperator
src/products/products.service.ts:38:9
 
   async onModuleInit() {
     const count = await this.productModel.countDocuments();
-    if (count === 0) {
+    if (count !== 0) {
       console.log('База товарів порожня. Завантажую початкові дані...');
       await this.productModel.insertMany(INITIAL_STORE_DATA);

[Killed] BlockStatement
src/products/products.service.ts:45:39
     }
   }
 
-  async findAll(): Promise<Product[]> {
-    return this.productModel.find().exec();
-  }
+  async findAll(): Promise<Product[]> {}
 
   async findOne(id: number): Promise<Product | undefined> {
killedBy: ProductsService findAll should return an array of products
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: [{"productID": 1, "productName": "Test Book 1", "productPrice": 10, "produtDescription": "Desc 1"}, {"productID": 2, "productName": "Test Book 2", "productPrice": 20, "produtDescription": "Desc 2"}]
Received: undefined

[Killed] BlockStatement
src/products/products.service.ts:49:59
     return this.productModel.find().exec();
   }
 
-  async findOne(id: number): Promise<Product | undefined> {
-    const product = await this.productModel.findOne({ productID: id }).exec();
-    return product || undefined;
-  }
+  async findOne(id: number): Promise<Product | undefined> {}
 }
 
killedBy: ProductsService findOne should return a single product by ID
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"productID": 1, "productName": "Test Book 1", "productPrice": 10, "produtDescription": "Desc 1"}
Received: undefined

[Killed] ConditionalExpression
src/products/products.service.ts:51:12
 
   async findOne(id: number): Promise<Product | undefined> {
     const product = await this.productModel.findOne({ productID: id }).exec();
-    return product || undefined;
+    return false;
   }
 }
killedBy: ProductsService findOne should return a single product by ID
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"productID": 1, "productName": "Test Book 1", "productPrice": 10, "produtDescription": "Desc 1"}
Received: false

[Killed] ConditionalExpression
src/products/products.service.ts:51:12
 
   async findOne(id: number): Promise<Product | undefined> {
     const product = await this.productModel.findOne({ productID: id }).exec();
-    return product || undefined;
+    return true;
   }
 }
killedBy: ProductsService findOne should return a single product by ID
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"productID": 1, "productName": "Test Book 1", "productPrice": 10, "produtDescription": "Desc 1"}
Received: true
