[NoCoverage] BlockStatement
src/server-data/server-data.controller.ts:13:5
   handleCartData(@Body() cartData: ProductDto[]): {
     message: string;
     receivedCount: number;
-  } {
-    console.log('--- Received Cart Data ---');
-    console.log(cartData);
-
-    return {
-      message: 'Cart data received successfully!',
-      receivedCount: cartData.length,
-    };
-  }
+  } {}
 }
 

[NoCoverage] StringLiteral
src/server-data/server-data.controller.ts:18:16
     console.log(cartData);
 
     return {
-      message: 'Cart data received successfully!',
+      message: "",
       receivedCount: cartData.length,
     };
